Hi @lahuang4 - I pull a fresh/current copy of the repo and it's worked for me:

```
  # module.pubsub.google_pubsub_subscription.cloud_storage_subscriptions["example_bucket_subscription"] will be created
  + resource "google_pubsub_subscription" "cloud_storage_subscriptions" {
      + ack_deadline_seconds       = 300
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "example_bucket_subscription"
      + project                    = "ap-bps-experimental-gke"
      + terraform_labels           = (known after apply)
      + topic                      = "cft-tf-pubsub-topic-cloud-storage"

      + cloud_storage_config {
          + bucket                   = (known after apply)
          + filename_datetime_format = "YYYY-MM-DD/hh_mm_ssZ"
          + filename_prefix          = "example_prefix_"
          + filename_suffix          = "_example_suffix"
          + max_duration             = "300s"
          + state                    = (known after apply)
        }

      + expiration_policy (known after apply)
    }
```